xml/doctor2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" signAlgorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:gostr34102012-gostr34112012-256">
    <soapenv:Header>
        <wsse:Security soapenv:actor="http://eln.fss.ru/actor/doc/910334633251_4_doc">
            <wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="http://eln.fss.ru/actor/doc/910334633251_4_doc">MIIJXzCCCQygAwIBAgIRAJv0BBtrTYu01xqVpIGpSyQwCgYIKoUDBwEBAwIwggFrMSAwHgYJKoZI
                hvcNAQkBFhF1Y19ma0Byb3NrYXpuYS5ydTEYMBYGA1UECAwPNzcg0JzQvtGB0LrQstCwMRUwEwYF
                KoUDZAQSCjc3MTA1Njg3NjAxGDAWBgUqhQNkARINMTA0Nzc5NzAxOTgzMDFgMF4GA1UECQxX0JHQ
                vtC70YzRiNC+0Lkg0JfQu9Cw0YLQvtGD0YHRgtC40L3RgdC60LjQuSDQv9C10YDQtdGD0LvQvtC6
                LCDQtC4gNiwg0YHRgtGA0L7QtdC90LjQtSAxMRkwFwYDVQQHDBDQsy4g0JzQvtGB0LrQstCwMQsw
                CQYDVQQGEwJSVTE4MDYGA1UECgwv0KTQtdC00LXRgNCw0LvRjNC90L7QtSDQutCw0LfQvdCw0YfQ
                tdC50YHRgtCy0L4xODA2BgNVBAMML9Ck0LXQtNC10YDQsNC70YzQvdC+0LUg0LrQsNC30L3QsNGH
                0LXQudGB0YLQstC+MB4XDTI1MTAwMTEzMDYyOVoXDTI2MTIyNTEzMDYyOVowggIYMQswCQYDVQQG
                EwJSVTEqMCgGA1UECAwh0LMuINCh0LDQvdC60YIt0J/QtdGC0LXRgNCx0YPRgNCzMTUwMwYDVQQM
                DCzQktGA0LDRhy3Qv9C10LTQuNCw0YLRgCDRg9GH0LDRgdGC0LrQvtCy0YvQuTGB2DCB1QYDVQQK
                DIHN0KHQkNCd0JrQoi3Qn9CV0KLQldCg0JHQo9Cg0JPQodCa0J7QlSDQk9Ce0KHQo9CU0JDQoNCh
                0KLQktCV0J3QndCe0JUg0JHQrtCU0JbQldCi0J3QntCVINCj0KfQoNCV0JbQlNCV0J3QmNCVINCX
                0JTQoNCQ0JLQntCe0KXQoNCQ0J3QldCd0JjQryAi0JTQldCi0KHQmtCQ0K8g0JPQntCg0J7QlNCh
                0JrQkNCvINCf0J7Qm9CY0JrQm9CY0J3QmNCa0JAg4oSWIDE5IjEWMBQGBSqFA2QDEgsxNjA0MzY4
                NTQ1NzEaMBgGCCqFAwOBAwEBEgw1NjEwMTAwNzE3MTAxIzAhBgkqhkiG9w0BCQEWFHBkMTkuaXRA
                emRyYXYuc3BiLnJ1MSIwIAYDVQQqDBnQkNC90L3QsCDQmNCz0L7RgNC10LLQvdCwMRkwFwYDVQQE
                DBDQodC80LjRgNC90L7QstCwMTMwMQYDVQQDDCrQodC80LjRgNC90L7QstCwINCQ0L3QvdCwINCY
                0LPQvtGA0LXQstC90LAwZjAfBggqhQMHAQEBATATBgcqhQMCAiQABggqhQMHAQECAgNDAARAu6Hs
                kmnTCs6QHYXzASR4niP1dTNV/ElCHFHfsvsWqvx4PgXM0hu4IM2n5hAmjJEqa5hgEklWL7bag1FL
                q1HR76OCBNEwggTNMCsGA1UdEAQkMCKADzIwMjUxMDAxMTMzODAwWoEPMjAyNjEyMjUxMzM4MDBa
                MA4GA1UdDwEB/wQEAwID+DATBgNVHSUEDDAKBggrBgEFBQcDAjAdBgNVHSAEFjAUMAgGBiqFA2Rx
                ATAIBgYqhQNkcQIwDAYFKoUDZHIEAwIBADAtBgUqhQNkbwQkDCLQmtGA0LjQv9GC0L7Qn9GA0L4g
                Q1NQICg1LjAuMTIzMzApMIIBoQYFKoUDZHAEggGWMIIBkgyBh9Cf0YDQvtCz0YDQsNC80LzQvdC+
                LdCw0L/Qv9Cw0YDQsNGC0L3Ri9C5INC60L7QvNC/0LvQtdC60YEgVmlQTmV0IFBLSSBTZXJ2aWNl
                ICjQvdCwINCw0L/Qv9Cw0YDQsNGC0L3QvtC5INC/0LvQsNGC0YTQvtGA0LzQtSBIU00gMjAwMFEy
                KQxo0J/RgNC+0LPRgNCw0LzQvNC90L4t0LDQv9C/0LDRgNCw0YLQvdGL0Lkg0LrQvtC80L/Qu9C1
                0LrRgSDCq9Cu0L3QuNGB0LXRgNGCLdCT0J7QodCiwrsuINCS0LXRgNGB0LjRjyA0LjAMTUPQtdGA
                0YLQuNGE0LjQutCw0YIg0YHQvtC+0YLQstC10YLRgdGC0LLQuNGPIOKEltCh0KQvMTI0LTQzMjgg
                0L7RgiAyOS4wOC4yMDIyDE1D0LXRgNGC0LjRhNC40LrQsNGCINGB0L7QvtGC0LLQtdGC0YHRgtCy
                0LjRjyDihJbQodCkLzEyOC00NjM5INC+0YIgMDQuMTAuMjAyMzBmBgNVHR8EXzBdMC6gLKAqhiho
                dHRwOi8vY3JsLnJvc2them5hLnJ1L2NybC91Y2ZrXzIwMjUuY3JsMCugKaAnhiVodHRwOi8vY3Js
                LmZrLmxvY2FsL2NybC91Y2ZrXzIwMjUuY3JsMHcGCCsGAQUFBwEBBGswaTA0BggrBgEFBQcwAoYo
                aHR0cDovL2NybC5yb3NrYXpuYS5ydS9jcmwvdWNma18yMDI1LmNydDAxBggrBgEFBQcwAoYlaHR0
                cDovL2NybC5may5sb2NhbC9jcmwvdWNma18yMDI1LmNydDAdBgNVHQ4EFgQUiFLr6zF9I5XJApvV
                D64T651zR08wggF2BgNVHSMEggFtMIIBaYAUvz+8cqZrQ2drA0DMxq/G+sDNPfyhggFDpIIBPzCC
                ATsxITAfBgkqhkiG9w0BCQEWEmRpdEBkaWdpdGFsLmdvdi5ydTELMAkGA1UEBhMCUlUxGDAWBgNV
                BAgMDzc3INCc0L7RgdC60LLQsDEZMBcGA1UEBwwQ0LMuINCc0L7RgdC60LLQsDFTMFEGA1UECQxK
                0J/RgNC10YHQvdC10L3RgdC60LDRjyDQvdCw0LHQtdGA0LXQttC90LDRjywg0LTQvtC8IDEwLCDR
                gdGC0YDQvtC10L3QuNC1IDIxJjAkBgNVBAoMHdCc0LjQvdGG0LjRhNGA0Ysg0KDQvtGB0YHQuNC4
                MRgwFgYFKoUDZAESDTEwNDc3MDIwMjY3MDExFTATBgUqhQNkBBIKNzcxMDQ3NDM3NTEmMCQGA1UE
                Awwd0JzQuNC90YbQuNGE0YDRiyDQoNC+0YHRgdC40LiCCicyIggAAAAAC1QwCgYIKoUDBwEBAwID
                QQBM0WCBpqkVEmav3OtkFALnKyX/lq3i5S6Tuw0a2FsJidqTVJrSq5tlg3vsp7EOe37XFw36ezfv
                2jnfPDNaKvSE
            </wsse:BinarySecurityToken>
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                    <ds:SignatureMethod Algorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:gostr34102012-gostr34112012-256"/>
                    <ds:Reference URI="#ELN_910334633251_4_doc">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:gostr34112012-256"/>
                        <ds:DigestValue>ujNw27SUXA8RQtjIE1PJnfoVgUgiIvaaKHEg63SUH1M=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>+Q6G7wq7IbmwbnxZ9Ldr3aH5lIIGAgG7RUnv6itcQo+89h3ZdSG/hRhA6i2vIehOOMmRs2f6IKISGBBeu07TJA==</ds:SignatureValue>
                <ds:KeyInfo>
                    <wsse:SecurityTokenReference>
                        <wsse:Reference URI="#http://eln.fss.ru/actor/doc/910334633251_4_doc" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/>
                    </wsse:SecurityTokenReference>
                </ds:KeyInfo>
            </ds:Signature>
        </wsse:Security>
        <wsse:Security soapenv:actor="http://eln.fss.ru/actor/mo/1037828002442/ELN_910334633251">
            <wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="http://eln.fss.ru/actor/mo/1037828002442/ELN_910334633251">{certmo}</wsse:BinarySecurityToken>
        </wsse:Security>
        <ds:X509Certificate>{certmo}</ds:X509Certificate>
    </soapenv:Header>
    <soapenv:Body>
        <prParseFilelnlpuRequest xmlns="http://www.fss.ru/integration/types/eln/mo/v01">
            <ogrn>1037828002442</ogrn>
            <pXmlFile>
                <rowset xmlns:ns0="http://www.fss.ru/integration/types/eln/v01" ns0:author="" ns0:email="" ns0:phone="" ns0:software="Виста-МЕД" ns0:version="2.0" ns0:version_software="043892">
                    <row wsu:Id="ELN_910334633251">
                        <unconditional>true</unconditional>
                        <writtenAgreementFlag>true</writtenAgreementFlag>
                        <lnCode>910334633251</lnCode>
                        <primaryFlag>1</primaryFlag>
                        <duplicateFlag>0</duplicateFlag>
                        <lpuOgrn>{current_ogrn}</lpuOgrn>
                        <gender>1</gender>
                        <reason1/>
                        <reason2/>
                        <diagnos>J06.9</diagnos>
                        <mseDt1 xsi:nil="true"/>
                        <mseDt2 xsi:nil="true"/>
                        <mseDt3 xsi:nil="true"/>
                        <mseInvalidGroup xsi:nil="true"/>
                        <mseInvalidLoss>0</mseInvalidLoss>
                        <date1 xsi:nil="true"/>
                        <date2 xsi:nil="true"/>
                        <snils>12728323049</snils>
                        <surname>АНДРЕЕВА</surname>
                        <name>ЮЛИЯ</name>
                        <patronymic>ВЛАДИМИРОВНА</patronymic>
                        <lnDate>2026-02-12</lnDate>
                        <lpuName>СПБ ГБУЗ "ДЕТСКАЯ ГОРОДСКАЯ ПОЛИКЛИНИКА №19"</lpuName>
                        <lpuAddress>197046, СПБ, УЛ.КУЙБЫШЕВА, Д.25</lpuAddress>
                        <birthday>1969-01-14</birthday>
                        <lnState>010</lnState>
                        <lnHash>2B845E4499ACFDC2C92AFBE6B1AA0242</lnHash>
                        <intermittentMethodFlag>false</intermittentMethodFlag>
                        <treatPeriods>
                            <treatFullPeriod>
                                <treatPeriod xmlns="http://www.fss.ru/integration/types/eln/v01" wsu:Id="ELN_910334633251_3_doc">
                                    <treatDt1>2026-02-12</treatDt1>
                                    <treatDt2>2026-02-16</treatDt2>
                                    <treatDoctorRole>ЛЕЧАЩИЙ ВРАЧ</treatDoctorRole>
                                    <treatDoctor>РАСПУТИН С В</treatDoctor>
                                    <idDoctor>19522575290</idDoctor>
                                </treatPeriod>
                            </treatFullPeriod>
                            <treatFullPeriod>
                                <treatPeriod xmlns="http://www.fss.ru/integration/types/eln/v01" wsu:Id="ELN_910334633251_4_doc">
                                    <treatDt1>2026-02-17</treatDt1>
                                    <treatDt2>2026-02-20</treatDt2>
                                    <treatDoctorRole>ЛЕЧАЩИЙ ВРАЧ</treatDoctorRole>
                                    <treatDoctor>СМИРНОВА А И</treatDoctor>
                                    <idDoctor>16043685457</idDoctor>
                                </treatPeriod>
                            </treatFullPeriod>
                        </treatPeriods>
                        <servData>
                            <servFullData>
                                <ns0:servRelationCode>38</ns0:servRelationCode>
                                <ns0:servDt1>2026-02-12</ns0:servDt1>
                                <ns0:servDt2>2026-02-16</ns0:servDt2>
                                <ns0:treatmentType>1</ns0:treatmentType>
                                <ns0:surname>ХЛЕБНИКОВ</ns0:surname>
                                <ns0:name>МАТВЕЙ</ns0:name>
                                <ns0:patronymic>СЕРГЕЕВИЧ</ns0:patronymic>
                                <ns0:birthday>2023-05-16</ns0:birthday>
                                <ns0:reason1>09</ns0:reason1>
                                <ns0:snils>22189152864</ns0:snils>
                                <diagnosis>J06.9</diagnosis>
                            </servFullData>
                            <servFullData>
                                <ns0:servRelationCode>38</ns0:servRelationCode>
                                <ns0:servDt1>2026-02-17</ns0:servDt1>
                                <ns0:servDt2>2026-02-20</ns0:servDt2>
                                <ns0:treatmentType>1</ns0:treatmentType>
                                <ns0:surname>ХЛЕБНИКОВ</ns0:surname>
                                <ns0:name>МАТВЕЙ</ns0:name>
                                <ns0:patronymic>СЕРГЕЕВИЧ</ns0:patronymic>
                                <ns0:birthday>2023-05-16</ns0:birthday>
                                <ns0:reason1>09</ns0:reason1>
                                <ns0:snils>22189152864</ns0:snils>
                                <diagnosis>J06.9</diagnosis>
                            </servFullData>
                        </servData>
                    </row>
                </rowset>
            </pXmlFile>
        </prParseFilelnlpuRequest>
    </soapenv:Body>
</soapenv:Envelope>